package com.homework.stream11;

/**
 * Напиши программу, которая считывает из консоли имя текстового файла,
 * далее читает символы из этого файла (используй метод readAllLines(Path) класса Files) и выводит на экран все,
 * за исключением точки, запятой и пробела.
 * Требования:
 * •	Программа должна считать с консоли путь к файлу.
 * •	Программа должна вывести в консоль содержимое файла согласно условию.
 * •	Для чтения строк из файла должен быть использован метод readAllLines(Path) класса Files.
 * •	Не используй следующие классы: File, FileInputStream, FileOutputStream, FileReader, FileWriter пакета java.io.
 */
public class Stream3 {

  public static void main(String[] args) {
    //напишите тут ваш код
  }
}
