package com.homework.exception8;

/**
 * Объяви недостающие переменные и закомментируй те, которые нигде не используются.
 * Требования:
 * •	Программа должна выводить на экран текст.
 * •	Должно быть объявлено 4 переменные.
 * •	Нужно закомментировать неиспользуемые переменные.
 * •	Вывод программы не должен измениться.
 */

public class Exceptions4 {

  public static void main(String[] args) { //раскомментируй код
    String s = "15";
//    a = 5;
//    int z = 18;
//    int d = 18;
//    c = a + d;
//    b = " is better than ";
//
//    System.out.println(a + b + c);
  }

}
