package com.homework.methods5;

/**
 * Перед тобой — плохой пример использования методов:
 *
 * Методы разделили двустишие;
 * Одну строку кода не стоит оборачивать в отдельный метод.
 * Перепиши код так, чтобы весь текст выводился в методе main, а остальные методы удали.
 * Вывод программы не должен измениться.
 * Требования:
 * •	Метод main() должен быть единственным методом в классе Method1.
 * •	Вывод в консоли должен соответствовать условию задачи.
 */


public class Method1 {

  public static void main(String[] args) {
    System.out.println("Я — поэт, зовусь я Цветик.");
    System.out.println("От меня вам всем приветик.");
  }
}
