package com.homework.variables1;

/**
 *
 УсловиеДерево классов

 Точки и запятые важны не только в пунктуации в обычном тексте. Исправь ошибки в коде, чтобы программа компилировалась и работала.
 В коде уже есть кавычки, но, как оказалось, их недостаточно. Исправь ошибки в коде, чтобы программа компилировалась и работала.
 Требования:
 •	В методе main класса Variable21 должны быть исправлены ошибки компиляции.
 Требования:
 •	В методе main класса Variable21 должны быть исправлены ошибки компиляции.
 */

public class Variable21 {

  public static void main(String[] args) {
    int number = 1;
    System.out.println(number);
    String string = "Amigo";
    System.out.println(string);
  }
}
