package com.homework.variables1;

/**
 * Перед тобой класс Earth - сборник переменных, описывающих определенные характеристики планеты Земля.
 * Сделай из переменных класса Earth глобальные константы. Не забудь переименовать переменные, чтобы они отвечали стилю написания глобальных переменных.
 * Требования:
 * •	Переменную name класса Earth нужно переделать в глобальную переменную.
 * •	Переменную square класса Earth нужно переделать в глобальную переменную.
 * •	Переменную population класса Earth нужно переделать в глобальную переменную.
 * •	Переменную equatorLength класса Earth нужно переделать в глобальную переменную.
 */

// public static final

public class Variable14 {

  public class Earth {
    String name = "Земля";
    double square = 510_100_000;
    long population = 7_594_000_000L;
    long equatorLength = 40_075_696;
  }
}
