package com.homework.variables1;

/**
 *
 УсловиеДерево классов

 В методе main объяви переменные word, phrase, line и text типа String.
 Присвой им разные значения. Используй одну команду для создания и инициализации переменных.
 Значениями могут быть любые строки.
 Требования:
 •	В методе main объяви четыре переменные типа String.
 •	Назови переменные именами word, phrase, line и text.
 •	Переменным сразу присвой значения.
 •	У всех переменных должны быть разные значения.
 */

public class Variable5 {

  public static void main(String[] args) {
    //напишите тут ваш код

  }
}
